import Task1 from "./components/Task1/Task1";
import Task2 from "./components/Task2/Task2";
import Task3 from "./components/Task3/Task3";
import Task4 from "./components/Task4/Task4";

export const tasks = [
	{
		id: 1,
		title: "Задача 1",
		text: "Оптимізація вибіркового рендеру з useMemo та React.memo. Створіть компонент-калькулятор, який має два незалежні поля вводу: одне для числа A і одне для числа B. Також є окремий компонент ResultDisplay, який відображає A + B. Обгорніть ResultDisplay у React.memo(). Використайте useMemo в батьківському компоненті, щоб обчислити A + B і передати цей результат до ResultDisplay. Переконайтеся, що ResultDisplay ререндериться лише тоді, коли змінюються A або B, а не коли змінюється інший незалежний стан у батьківському компоненті (наприклад, лічильник, що не впливає на A чи B).",
		Component: Task1,
	},

	{
		id: 2,
		title: "Задача 2",
		text: "Таблиця з фільтрацією та сортуванням, чутлива до UI. Створіть компонент DataGrid (батьківський) та GridRow (дочірній). DataGrid отримує великий масив даних, має поле вводу для фільтрації, кнопки для сортування за різними колонками. GridRow (обгорнутий у React.memo) відображає один рядок даних. Використайте useDeferredValue для пошукового запиту та/або параметрів сортування. Використайте useMemo для обчислення відфільтрованих та відсортованих даних на основі відкладених значень. Використайте useCallback для функцій-обробників сортування та інших інтерактивних елементів, які передаються до дочірніх компонентів. Мета: забезпечити швидкий відгук на введення та кліки, навіть якщо обробка даних займає час.",
		Component: Task2,
	},
	{
		id: 3,
		title: "Задача 3",
		text: "useWindowSize – розмір вікна браузера. Створіть кастомний хук useWindowSize, який повертає поточну ширину та висоту вікна браузера. Він повинен оновлюватися при зміні розміру вікна. Створіть компонент, який відображає поточні розміри вікна браузера (ширина x висота), використовуючи useWindowSize. На основі розмірів відображати іконки монітора, планшета або телефона.",
		Component: Task3,
	},
	{
		id: 4,
		title: "Задача 4",
		text: "useDebounce – відкладений виклик функції. Створіть кастомний хук useDebounce, який приймає значення та затримку в мілісекундах. Він повинен повертати 'відкладене' значення, яке оновлюється лише після того, як минув заданий час без змін. Створіть поле пошуку, де результати пошуку оновлюються не відразу після кожного символу, а з невеликою затримкою (наприклад, 500мс) після зупинки введення, використовуючи useDebounce.",
		Component: Task4,
	},
];
